{
    "items":  [
                  {
                      "title":  "That handy-looking router USB port can cause problems - here\u0027s what PC experts use instead",
                      "link":  "https://www.zdnet.com/article/do-not-use-router-usb-port-why/",
                      "pubDate":  "Tue, 13 Jan 2026 12:15:00 GMT",
                      "description":  "Your router\u0027s USB port is convenient, but its unreliability makes it susceptible to a potential security risk. Here\u0027s the alternative.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "Own an Android phone? I changed these 12 settings to greatly improve the battery life",
                      "link":  "https://www.zdnet.com/article/change-android-phone-settings-improve-battery-life/",
                      "pubDate":  "Tue, 13 Jan 2026 12:13:00 GMT",
                      "description":  "Battery dropping too fast? Consider these 12 expert-approved tips to make your device last longer.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "10+ useful Google Docs tricks that streamlined my workflow (no plug-ins required)",
                      "link":  "https://www.zdnet.com/article/best-google-docs-features/",
                      "pubDate":  "Tue, 13 Jan 2026 12:12:00 GMT",
                      "description":  "From editable PDFs to instant translations, Google Docs is stacked with features that most people overlook.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "Skipping this PC maintenance step could cost you - here\u0027s the right way to clean your system",
                      "link":  "https://www.zdnet.com/article/how-to-clean-your-pc/",
                      "pubDate":  "Tue, 13 Jan 2026 12:08:00 GMT",
                      "description":  "Regular PC maintenance keeps your computer operating smoothly for years - here are a few simple ways to care for your tech.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "How much RAM does your PC really need in 2026? A Windows and Mac expert\u0027s verdict",
                      "link":  "https://www.zdnet.com/article/how-much-ram-pc-mac-2026/",
                      "pubDate":  "Tue, 13 Jan 2026 12:06:00 GMT",
                      "description":  "Considering a PC upgrade, but unsure about RAM? Here\u0027s what a tech expert recommends.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "Own an Apple TV? I changed these 12 settings to make the system run like new again",
                      "link":  "https://www.zdnet.com/article/apple-tv-change-settings-upgrade/",
                      "pubDate":  "Tue, 13 Jan 2026 12:04:00 GMT",
                      "description":  "These Apple TV adjustments can greatly enhance your viewing experience. Here are my go-tos.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "Too many people are overlooking Anker\u0027s ingenious charging accessories lineup for 2026",
                      "link":  "https://www.zdnet.com/article/anker-chargers-ces-2026/",
                      "pubDate":  "Tue, 13 Jan 2026 12:01:00 GMT",
                      "description":  "Besides the Nano Charger, Anker\u0027s CES 2026 lineup includes a charging station, a dock, and a power strip.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "I compared the best soundbars from Sonos and Samsung, and this one wins it for me",
                      "link":  "https://www.zdnet.com/article/samsung-hw0q990f-vs-sonos-arc-ultra/",
                      "pubDate":  "Tue, 13 Jan 2026 11:59:00 GMT",
                      "description":  "Upgrading your home theater with one of the best soundbars isn\u0027t a decision you make on the fly. Here\u0027s what you should know first.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "Why I\u0027m more excited about these Klipsch headphones than Sony and Bose releases in 2026",
                      "link":  "https://www.zdnet.com/article/klipsch-headphones-speakers-ces/",
                      "pubDate":  "Tue, 13 Jan 2026 11:58:00 GMT",
                      "description":  "I went hands-on with Klipsch at CES, and now I\u0027m impatient for their summer launch.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "This clever Victrola upgrade eliminates a major headache for record players",
                      "link":  "https://www.zdnet.com/article/victrola-soundstage-ces/",
                      "pubDate":  "Tue, 13 Jan 2026 11:56:00 GMT",
                      "description":  "Short on space and want an alternative to bookshelf speakers? Victrola\u0027s new Soundstage promises big vinyl sound.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "Why I put my Bose QuietComfort headphones away shortly after testing this competitor",
                      "link":  "https://www.zdnet.com/article/bowers-and-wilkins-px8-p2-headphones-review/",
                      "pubDate":  "Tue, 13 Jan 2026 11:52:00 GMT",
                      "description":  "On paper, the Bowers \u0026 Wilkins Px8 S2 may look eerily similar to the midrange Px7 S3. But the price bump is easily justified.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "5 sure-fire ways to upgrade your soundbar\u0027s audio quality without spending a dime",
                      "link":  "https://www.zdnet.com/article/5-ways-improve-soundbar-audio/",
                      "pubDate":  "Tue, 13 Jan 2026 11:50:00 GMT",
                      "description":  "Your soundbar may sound decent - or not - but a few quick tweaks can noticeably improve its performance.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "How to clear the cache on your TV (and wipe out lag for good)",
                      "link":  "https://www.zdnet.com/article/how-to-clear-tv-cache/",
                      "pubDate":  "Tue, 13 Jan 2026 11:48:00 GMT",
                      "description":  "Clearing your TV\u0027s cache significantly lowers stuttering and improves performance. Here\u0027s how to do it on brands like Samsung, LG, and more.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "Is this tiny \u0027advanced electromagnetic\u0027 car de-icing gadget legit? (spoiler: no)",
                      "link":  "https://www.zdnet.com/article/car-deicing-gadget-scam/",
                      "pubDate":  "Tue, 13 Jan 2026 10:09:01 GMT",
                      "description":  "Let\u0027s take a look at one of the latest scam gadgets on social media.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "Verizon will give you an iPhone 17 Pro Max for free - here\u0027s how to qualify",
                      "link":  "https://www.zdnet.com/article/verizon-iphone-17-pro-max-deal/",
                      "pubDate":  "Tue, 13 Jan 2026 10:01:06 GMT",
                      "description":  "The iPhone 17 Pro Max boasts numerous features that make it a compelling iPhone upgrade or a solid reason to switch to iOS. New Verizon customers can get one for free with this plan.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "The best proxy server services of 2026: Expert tested and reviewed",
                      "link":  "https://www.zdnet.com/article/best-proxy-server-services/",
                      "pubDate":  "Tue, 13 Jan 2026 10:00:51 GMT",
                      "description":  "We recommend these top services to help you successfully launch your new online project or business, whether you need a proxy for security, scraping, or data gathering.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "I sat down with Bluetooth reps at CES 2026 - and what they told me changed my perspective forever",
                      "link":  "https://www.zdnet.com/article/bluetooth-forecase-ces-2026/",
                      "pubDate":  "Tue, 13 Jan 2026 09:01:29 GMT",
                      "description":  "It might be time to change how you think about Bluetooth.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "Is AI coming for your job? Here\u0027s one labor indicator that could soothe your fears",
                      "link":  "https://www.zdnet.com/article/ai-job-anxiety-labor-indicator-forrester/",
                      "pubDate":  "Tue, 13 Jan 2026 09:00:48 GMT",
                      "description":  "Not quite an apocalypse: AI could replace 6% of US jobs by 2030, Forrester report finds.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "These earbuds\u0027 sound beats my favorite pair - and from the brand I least expected",
                      "link":  "https://www.zdnet.com/article/google-pixel-buds-pro-2-review/",
                      "pubDate":  "Tue, 13 Jan 2026 08:40:46 GMT",
                      "description":  "After giving up on my original Pixel Buds Pro, I rolled the dice on a pair of Pro 2 earbuds. I\u0027m shocked at how much they\u0027ve improved.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "This Bose speaker will reach EOL in 2026 - but open source is here to save the day",
                      "link":  "https://www.zdnet.com/article/bose-soundtouch-speaker-eol-open-source/",
                      "pubDate":  "Tue, 13 Jan 2026 04:00:00 GMT",
                      "description":  "All companies should do this.",
                      "_source":  "ZDNet Security"
                  },
                  {
                      "title":  "Who Benefited from the Aisuru and Kimwolf Botnets?",
                      "link":  "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
                      "pubDate":  "Thu, 08 Jan 2026 23:23:43 +0000",
                      "description":  "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we\u0027ll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf\u0027s spread.",
                      "_source":  "KrebsOnSecurity"
                  },
                  {
                      "title":  "The Kimwolf Botnet is Stalking Your Local Network",
                      "link":  "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
                      "pubDate":  "Fri, 02 Jan 2026 14:20:10 +0000",
                      "description":  "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it\u0027s time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.",
                      "_source":  "KrebsOnSecurity"
                  },
                  {
                      "title":  "Happy 16th Birthday, KrebsOnSecurity.com!",
                      "link":  "https://krebsonsecurity.com/2025/12/happy-16th-birthday-krebsonsecurity-com/",
                      "pubDate":  "Mon, 29 Dec 2025 20:23:26 +0000",
                      "description":  "KrebsOnSecurity.com celebrates its 16th anniversary today! A huge \"thank you\" to all of our readers -- newcomers, long-timers and drive-by critics alike. Your engagement this past year here has been tremendous and truly a salve on a handful of dark days. Happily, comeuppance was a strong theme running through our coverage in 2025, with a primary focus on entities that enabled complex and globally-dispersed cybercrime services.",
                      "_source":  "KrebsOnSecurity"
                  },
                  {
                      "title":  "Dismantling Defenses: Trump 2.0 Cyber Year in Review",
                      "link":  "https://krebsonsecurity.com/2025/12/dismantling-defenses-trump-2-0-cyber-year-in-review/",
                      "pubDate":  "Fri, 19 Dec 2025 15:14:55 +0000",
                      "description":  "The Trump administration has pursued a staggering range of policy pivots this past year that threaten to weaken the nation’s ability and willingness to address a broad spectrum of technology challenges, from cybersecurity and privacy to countering disinformation, fraud and corruption. These shifts, along with the president’s efforts to restrict free speech and freedom of the press, have come at such a rapid clip that many readers probably aren’t even aware of them all.",
                      "_source":  "KrebsOnSecurity"
                  },
                  {
                      "title":  "Most Parked Domains Now Serving Malicious Content",
                      "link":  "https://krebsonsecurity.com/2025/12/most-parked-domains-now-serving-malicious-content/",
                      "pubDate":  "Tue, 16 Dec 2025 14:14:48 +0000",
                      "description":  "Direct navigation -- the act of visiting a website by manually typing a domain name in a web browser -- has never been riskier: A new study finds the vast majority of \"parked\" domains -- mostly expired or dormant domain names, or common misspellings of popular websites -- are now configured to redirect visitors to sites that foist scams and malware.",
                      "_source":  "KrebsOnSecurity"
                  },
                  {
                      "title":  "Microsoft Patch Tuesday, December 2025 Edition",
                      "link":  "https://krebsonsecurity.com/2025/12/microsoft-patch-tuesday-december-2025-edition/",
                      "pubDate":  "Tue, 09 Dec 2025 23:18:29 +0000",
                      "description":  "Microsoft today pushed updates to fix at least 56 security flaws in its Windows operating systems and supported software. This final Patch Tuesday of 2025 tackles one zero-day bug that is already being exploited, as well as two publicly disclosed vulnerabilities.",
                      "_source":  "KrebsOnSecurity"
                  },
                  {
                      "title":  "Drones to Diplomas: How Russia’s Largest Private University is Linked to a $25M Essay Mill",
                      "link":  "https://krebsonsecurity.com/2025/12/drones-to-diplomas-how-russias-largest-private-university-is-linked-to-a-25m-essay-mill/",
                      "pubDate":  "Sat, 06 Dec 2025 14:45:03 +0000",
                      "description":  "A sprawling academic cheating network turbocharged by Google Ads that has generated nearly $25 million in revenue has curious connections to a Kremlin-connected oligarch whose Russian university builds drones for Russia\u0027s war against Ukraine.",
                      "_source":  "KrebsOnSecurity"
                  },
                  {
                      "title":  "SMS Phishers Pivot to Points, Taxes, Fake Retailers",
                      "link":  "https://krebsonsecurity.com/2025/12/sms-phishers-pivot-to-points-taxes-fake-retailers/",
                      "pubDate":  "Thu, 04 Dec 2025 23:02:34 +0000",
                      "description":  "China-based phishing groups blamed for non-stop scam SMS messages about a supposed wayward package or unpaid toll fee are promoting a new offering, just in time for the holiday shopping season: Phishing kits for mass-creating fake but convincing e-commerce websites that convert customer payment card data into mobile wallets from Apple and Google. Experts say these same phishing groups also are now using SMS lures that promise unclaimed tax refunds and mobile rewards points.",
                      "_source":  "KrebsOnSecurity"
                  },
                  {
                      "title":  "Meet Rey, the Admin of ‘Scattered Lapsus$ Hunters’",
                      "link":  "https://krebsonsecurity.com/2025/11/meet-rey-the-admin-of-scattered-lapsus-hunters/",
                      "pubDate":  "Wed, 26 Nov 2025 17:22:36 +0000",
                      "description":  "A prolific cybercriminal group that calls itself \"Scattered LAPSUS$ Hunters\" made headlines regularly this year by stealing data from and publicly mass extorting dozens of major corporations. But the tables seem to have turned somewhat for \"Rey,\" the moniker chosen by the technical operator and public face of the hacker group: Earlier this week, Rey confirmed his real life identity and agreed to an interview after KrebsOnSecurity tracked him down and contacted his father.",
                      "_source":  "KrebsOnSecurity"
                  },
                  {
                      "title":  "Is Your Android TV Streaming Box Part of a Botnet?",
                      "link":  "https://krebsonsecurity.com/2025/11/is-your-android-tv-streaming-box-part-of-a-botnet/",
                      "pubDate":  "Mon, 24 Nov 2025 18:44:52 +0000",
                      "description":  "On the surface, the Superbox media streaming devices for sale at retailers like BestBuy and Walmart may seem like a steal: They offer unlimited access to more than 2,200 pay-per-view and streaming services like Netflix, ESPN and Hulu, all for a one-time fee of around $400. But security experts warn these TV boxes require intrusive software that forces the user\u0027s network to relay Internet traffic for others, traffic that is often tied to cybercrime activity such as advertising fraud and account takeovers.",
                      "_source":  "KrebsOnSecurity"
                  }
              ],
    "fetchedAt":  1768310540
}